app/controllers/books_controller.rb

INSERT INTO "books" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Harry Potter"], ["created_at", "2024-09-04 02:37:44.083082"], ["updated_at", "2024-09-04 02:37:44.083082"]]
---
  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_book
      @book = Book.find_by(id: params[:id])